cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C123GH6PGE.svd
        <register>
          <name>RXCSRH4</name>
          <description>USB Receive Control and Status Endpoint 4 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000147</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH4_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH4_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT4</name>
          <description>USB Receive Byte Count Endpoint 4</description>
          <addressOffset>0x00000148</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT4_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE4</name>
          <description>USB Host Transmit Configure Type Endpoint 4</description>
          <addressOffset>0x0000014A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE4_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_TXTYPE4_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE4_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE4_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE4_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL4</name>
          <description>USB Host Transmit Interval Endpoint 4</description>
          <addressOffset>0x0000014B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL4_TXPOLL</name>
              <description>TX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL4</name>
          <description>USB Host Transmit Interval Endpoint 4</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000014B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL4_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXTYPE4</name>
          <description>USB Host Configure Receive Type Endpoint 4</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE4_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_RXTYPE4_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE4_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE4_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE4_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL4</name>
          <description>USB Host Receive Polling Interval Endpoint 4</description>
          <addressOffset>0x0000014D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL4_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL4</name>
          <description>USB Host Receive Polling Interval Endpoint 4</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000014D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL4_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP5</name>
          <description>USB Maximum Transmit Data Endpoint 5</description>
          <addressOffset>0x00000150</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP5_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL5</name>
          <description>USB Transmit Control and Status Endpoint 5 Low</description>
          <addressOffset>0x00000152</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL5_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL5</name>
          <description>USB Transmit Control and Status Endpoint 5 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000152</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL5_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL5_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH5</name>
          <description>USB Transmit Control and Status Endpoint 5 High</description>
          <addressOffset>0x00000153</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH5_DT</name>
              <description>Data Toggle</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH5_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH5_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH5_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH5_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH5_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH5_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH5_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP5</name>
          <description>USB Maximum Receive Data Endpoint 5</description>
          <addressOffset>0x00000154</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP5_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL5</name>
          <description>USB Receive Control and Status Endpoint 5 Low</description>
          <addressOffset>0x00000156</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL5_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL5</name>
          <description>USB Receive Control and Status Endpoint 5 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000156</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL5_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL5_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH5</name>
          <description>USB Receive Control and Status Endpoint 5 High</description>
          <addressOffset>0x00000157</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH5_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH5_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH5_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH5_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH5_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH5_AUTORQ</name>
              <description>Auto Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH5_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH5</name>
          <description>USB Receive Control and Status Endpoint 5 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000157</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH5_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH5_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT5</name>
          <description>USB Receive Byte Count Endpoint 5</description>
          <addressOffset>0x00000158</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT5_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXTYPE5</name>
          <description>USB Host Transmit Configure Type Endpoint 5</description>
          <addressOffset>0x0000015A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXTYPE5_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_TXTYPE5_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE5_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE5_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL5</name>
          <description>USB Host Transmit Interval Endpoint 5</description>
          <addressOffset>0x0000015B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL5_TXPOLL</name>
              <description>TX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXINTERVAL5</name>
          <description>USB Host Transmit Interval Endpoint 5</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000015B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXINTERVAL5_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
